app/views/professionals/index.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."professional_id" = ?  [["professional_id", 1]]
---
        <% end %>
        <% if professional.appointments.length > 0 %>