app/views/professionals/month.html.erb

      <div class="col">
        <% @professional.appointments.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."professional_id" = ?  [["professional_id", 3]]