app/views/professionals/show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."professional_id" = ?  [["professional_id", 3]]
---
    <tbody>
    <% @professional.appointments.each do |appointment| %>