app/views/professionals/week_download.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."professional_id" = ?  [["professional_id", 1]]
---
      <div class="col">
        <% @professional.appointments.each do |appointment| %>