app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("name", "surname", "phone", "date", "notes", "professional_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "date" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["date", "2021-12-10 14:17:00"], ["updated_at", "2021-12-09 15:48:29.819317"], ["id", 2]]

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 12]]