app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE (date.to_date > '2021-12-06') LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "appointments" WHERE (date >= '2021-12-06')
---
  def index
    @appointments = Appointment.where('date >= ?', Date.today).page params[:page]