app/controllers/professionals_controller.rb

  def index
    @professionals = Professional.order(:name).page params[:page]
---
SELECT "professionals".* FROM "professionals" ORDER BY "professionals"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]