app/controllers/professionals_controller.rb

SELECT "professionals".* FROM "professionals"
---
  def index
    @professionals = Professional.all

INSERT INTO "professionals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "TestDos"], ["created_at", "2021-12-05 19:04:15.367488"], ["updated_at", "2021-12-05 19:04:15.367488"]]
---
  def create
    puts(professional_params)
    @professional = Professional.new(professional_params)
    puts(professional_params)

    respond_to do |format|
      if @professional.save

UPDATE "professionals" SET "name" = ?, "updated_at" = ? WHERE "professionals"."id" = ?  [["name", "JuanCarlo"], ["updated_at", "2021-12-09 14:49:31.011559"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @professional.update(professional_params)

DELETE FROM "professionals" WHERE "professionals"."id" = ?  [["id", 1]]
---
  def destroy
    @professional.destroy

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_professional
      @professional = Professional.find(params[:id])