app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @users = User.page params[:page]

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Hola"], ["password", "asd"], ["created_at", "2021-12-04 14:31:27.766165"], ["updated_at", "2021-12-04 14:31:27.766165"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = ?, "encrypted_password" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-09 15:49:17.918638"], ["encrypted_password", "$2a$12$btW9vF80cAARmBt8nZqkbO0WKfjlMzFHWPFsrYZv/jissP1dJucHC"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    if @user.appointments.length < 0
      @user.destroy