app/views/appointments/_form.html.erb

SELECT "professionals".* FROM "professionals" ORDER BY "professionals"."name" ASC
---
    <%= form.label :professional %>
    <%= form.collection_select :professional_id, Professional.order(:name),:id,:name, include_blank: true,
                               class:'form-control' %>