app/views/appointments/index.html.erb

SELECT "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= can? :read, @appointments %></td>
        <td><%= Professional.find(appointment.professional_id).name %></td>