app/views/appointments/month_download.html.erb

SELECT "professionals".* FROM "professionals"
---
      <div class="col">
        <% Professional.all.each do |prof| %>