app/views/appointments/week_download.html.erb

      <div class="col">
        <% Professional.all.each do |prof| %>
---
SELECT "professionals".* FROM "professionals"